GetStream/stream-video-esp32/examples/minimal/sdkconfig.defaults
# Default SDK configuration for minimal example
# This file provides default settings for ESP32-S3

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# WebSocket
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# mbedTLS - Enable DTLS-SRTP support for WebRTC (required by esp_peer)
CONFIG_MBEDTLS_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_CONNECTION_ID=y
CONFIG_MBEDTLS_SSL_DTLS_ANTI_REPLAY=y
CONFIG_MBEDTLS_SSL_DTLS_CLIENT_PORT_REUSE=y
CONFIG_MBEDTLS_SSL_DTLS_BADMAC_LIMIT=10
CONFIG_MBEDTLS_SSL_DTLS_HANDSHAKE_TIMEOUT=60000

